src/Catalogs/СообщенияЧата.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Catalog>
		<Properties>
			<Name>СообщенияЧата</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТекстСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТранспортноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТранспортныеСредства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаналЧата</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РолиСотрудников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Телеграм_ИдСообщения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/InformationRegisters/ЗакрепленныеСотрудники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<InformationRegister>
		<Properties>
			<Name>ЗакрепленныеСотрудники</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТранспортноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТранспортныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Catalogs/СообщенияЧата/Ext/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ТекстСообщения = СокрЛП(ТекстСообщения);
	
	Если ЭтоНовый() Тогда
		ДатаСоздания = ТекущаяДатаСеанса();
		Наименование = ТекстСообщения;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	#Если НЕ МобильноеПриложениеСервер Тогда
		
		Если ОбменДанными.Загрузка И Не ЗначениеЗаполнено(Телеграм_ИдСообщения) Тогда
			
			ВыборкаАдресатов = РегистрыСведений.ЗакрепленныеСотрудники.ПолучитьВыборкуСотрудниковПоТранспортномуСредству(ТранспортноеСредство);

			Пока ВыборкаАдресатов.Следующий() Цикл
			
				ТекстСообщенияТелеграм = "" + ТранспортноеСредство + ": " + ТекстСообщения;
				Telegram.ОтправитьСообщение(ВыборкаАдресатов.ИдЧата, ТекстСообщенияТелеграм, Ссылка);			
			
			КонецЦикла;
			
		Иначе
			
			Уведомление = Новый ДоставляемоеУведомление();
			Уведомление.Текст = "" + Автор + ": " + Лев(ТекстСообщения, 25);
			
			ИдентификаторПолучателя = ТранспортноеСредство.ИдентификаторУстройства.Получить();
			РаботаСДоставляемымиУведомлениями.ОтправитьУведомление(Уведомление, ИдентификаторПолучателя, Ссылка);
			
		КонецЕсли;
		
	#КонецЕсли	
	
КонецПроцедуры
